pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
<module id="ADC12_B" HW_revision="367.0">
    <register id="ADC12CTL0" width="16" offset="0x0" internal="0" description="ADC12_B Control 0">
        <bitfield id="ADC12SC" description="start conversion" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12SC_0" value="0x0" description="No sample-and-conversion-start"/>
            <bitenum id="ADC12SC_1" value="0x1" description="Start sample-and-conversion"/>
        </bitfield>
        <bitfield id="ADC12ENC" description="enable conversion" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12ENC_0" value="0x0" description="ADC12_B disabled"/>
            <bitenum id="ADC12ENC_1" value="0x1" description="ADC12_B enabled"/>
        </bitfield>
        <bitfield id="ADC12ON" description="ADC on" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12ON_0" value="0x0" description="ADC12_B off"/>
            <bitenum id="ADC12ON_1" value="0x1" description="ADC12_B on"/>
        </bitfield>
        <bitfield id="ADC12MSC" description="sample-and-hold time." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12MSC_0" value="0x0" description="The sampling timer requires a rising edge of the SHI signal to trigger each sample-and-convert."/>
            <bitenum id="ADC12MSC_1" value="0x1" description="The incidence of a positive(or for devices first rising edge of the) SHI signal triggers the sampling timer, but further sample-and-conversions are performed automatically as soon as the prior conversion is completed."/>
        </bitfield>
        <bitfield id="ADC12SHT0" description="sample-and-hold time." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC12SHT0_0" value="0x0" description="4 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_1" value="0x1" description="8 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_2" value="0x2" description="16 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_3" value="0x3" description="32 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_4" value="0x4" description="64 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_5" value="0x5" description="96 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_6" value="0x6" description="128 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_7" value="0x7" description="192 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_8" value="0x8" description="256 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_9" value="0x9" description="384 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_10" value="0xA" description="512 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT0_11" value="0xB" description="Reserved"/>
            <bitenum id="ADC12SHT0_12" value="0xC" description="Reserved"/>
            <bitenum id="ADC12SHT0_13" value="0xD" description="Reserved"/>
            <bitenum id="ADC12SHT0_14" value="0xE" description="Reserved"/>
            <bitenum id="ADC12SHT0_15" value="0xF" description="Reserved"/>
        </bitfield>
        <bitfield id="ADC12SHT1" description="sample-and-hold time." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="ADC12SHT1_0" value="0x0" description="4 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_1" value="0x1" description="8 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_2" value="0x2" description="16 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_3" value="0x3" description="32 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_4" value="0x4" description="64 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_5" value="0x5" description="96 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_6" value="0x6" description="128 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_7" value="0x7" description="192 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_8" value="0x8" description="256 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_9" value="0x9" description="384 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_10" value="0xA" description="512 ADC12CLK cycles"/>
            <bitenum id="ADC12SHT1_11" value="0xB" description="Reserved"/>
            <bitenum id="ADC12SHT1_12" value="0xC" description="Reserved"/>
            <bitenum id="ADC12SHT1_13" value="0xD" description="Reserved"/>
            <bitenum id="ADC12SHT1_14" value="0xE" description="Reserved"/>
            <bitenum id="ADC12SHT1_15" value="0xF" description="Reserved"/>
        </bitfield>
    </register>
    <register id="ADC12CTL1" width="16" offset="0x2" internal="0" description="ADC12_B Control 1">
        <bitfield id="ADC12BUSY" description="ADC busy" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ADC12BUSY_0" value="0x0" description="No operation is active."/>
            <bitenum id="ADC12BUSY_1" value="0x1" description="A sequence, sample, or conversion is active."/>
        </bitfield>
        <bitfield id="ADC12CONSEQ" description="conversion sequence mode select" begin="2" end="1" width="2" rwaccess="R/W">
            <bitenum id="ADC12CONSEQ_0" value="0x0" description="Single-channel, single-conversion"/>
            <bitenum id="ADC12CONSEQ_1" value="0x1" description="Sequence-of-channels"/>
            <bitenum id="ADC12CONSEQ_2" value="0x2" description="Repeat-single-channel"/>
            <bitenum id="ADC12CONSEQ_3" value="0x3" description="Repeat-sequence-of-channels"/>
        </bitfield>
        <bitfield id="ADC12SSEL" description="clock source select" begin="4" end="3" width="2" rwaccess="R/W">
            <bitenum id="ADC12SSEL_0" value="0x0" description="ADC12OSC (MODOSC)"/>
            <bitenum id="ADC12SSEL_1" value="0x1" description="ACLK"/>
            <bitenum id="ADC12SSEL_2" value="0x2" description="MCLK"/>
            <bitenum id="ADC12SSEL_3" value="0x3" description="SMCLK"/>
        </bitfield>
        <bitfield id="ADC12DIV" description="clock divider" begin="7" end="5" width="3" rwaccess="R/W">
            <bitenum id="ADC12DIV_0" value="0x0" description="/1"/>
            <bitenum id="ADC12DIV_1" value="0x1" description="/2"/>
            <bitenum id="ADC12DIV_2" value="0x2" description="/3"/>
            <bitenum id="ADC12DIV_3" value="0x3" description="/4"/>
            <bitenum id="ADC12DIV_4" value="0x4" description="/5"/>
            <bitenum id="ADC12DIV_5" value="0x5" description="/6"/>
            <bitenum id="ADC12DIV_6" value="0x6" description="/7"/>
            <bitenum id="ADC12DIV_7" value="0x7" description="/8"/>
        </bitfield>
        <bitfield id="ADC12ISSH" description="invert signal sample-and-hold" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12ISSH_0" value="0x0" description="The sample-input signal is not inverted."/>
            <bitenum id="ADC12ISSH_1" value="0x1" description="The sample-input signal is inverted."/>
        </bitfield>
        <bitfield id="ADC12SHP" description="sample-and-hold pulse-mode select" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12SHP_0" value="0x0" description="SAMPCON signal is sourced from the sample-input signal."/>
            <bitenum id="ADC12SHP_1" value="0x1" description="SAMPCON signal is sourced from the sampling timer."/>
        </bitfield>
        <bitfield id="ADC12SHS" description="sample-and-hold source select" begin="12" end="10" width="3" rwaccess="R/W">
            <bitenum id="ADC12SHS_0" value="0x0" description="ADC12SC bit"/>
            <bitenum id="ADC12SHS_1" value="0x1" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_2" value="0x2" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_3" value="0x3" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_4" value="0x4" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_5" value="0x5" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_6" value="0x6" description="see the device-specific data sheet for source"/>
            <bitenum id="ADC12SHS_7" value="0x7" description="see the device-specific data sheet for source"/>
        </bitfield>
        <bitfield id="ADC12PDIV" description="predivider" begin="14" end="13" width="2" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="Predivide by 1"/>
            <bitenum id="4" value="0x1" description="Predivide by 4"/>
            <bitenum id="32" value="0x2" description="Predivide by 32"/>
            <bitenum id="64" value="0x3" description="Predivide by 64"/>
        </bitfield>
    </register>
