pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
    <register id="ADC12CTL2" width="16" offset="0x4" internal="0" description="ADC12_B Control 2">
        <bitfield id="ADC12PWRMD" description="low-power mode" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12PWRMD_0" value="0x0" description="Regular power mode where sample rate is not restricted"/>
            <bitenum id="ADC12PWRMD_1" value="0x1" description="Low power mode enable, ADC12CLK can not be greater than 1/4 the device-specific data sheet specified maximum for ADC12PWRMD = 0"/>
        </bitfield>
        <bitfield id="ADC12DF" description="data read-back format" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12DF_0" value="0x0" description="Binary unsigned. Theoretically for ADC12DIF = 0 and 12-bit mode the analog input voltage  VREF results in 0000h, the analog input voltage + VREF results in 0FFFh."/>
            <bitenum id="ADC12DF_1" value="0x1" description="Signed binary (2s complement), left aligned. Theoretically, for ADC12DIF = 0 and 12-bit mode, the analog input voltage  VREF results in 8000h, the analog input voltage + VREF results in 7FF0h."/>
        </bitfield>
        <bitfield id="ADC12RES" description="resolution" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8 bit (10 clock cycle conversion time)"/>
            <bitenum id="10BIT" value="0x1" description="10 bit (12 clock cycle conversion time)"/>
            <bitenum id="12BIT" value="0x2" description="12 bit (14 clock cycle conversion time)"/>
            <bitenum id="ADC12RES_3" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="ADC12CTL3" width="16" offset="0x6" internal="0" description="ADC12_B Control 3">
        <bitfield id="ADC12CSTARTADD" description="conversion start address" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC12MEM0" value="0x0" description="Conversion start address ADC12MEM0"/>
            <bitenum id="ADC12MEM1" value="0x1" description="Conversion start address ADC12MEM1"/>
            <bitenum id="ADC12MEM2" value="0x2" description="Conversion start address ADC12MEM2"/>
            <bitenum id="ADC12MEM3" value="0x3" description="Conversion start address ADC12MEM3"/>
            <bitenum id="ADC12MEM4" value="0x4" description="Conversion start address ADC12MEM4"/>
            <bitenum id="ADC12MEM5" value="0x5" description="Conversion start address ADC12MEM5"/>
            <bitenum id="ADC12MEM6" value="0x6" description="Conversion start address ADC12MEM6"/>
            <bitenum id="ADC12MEM7" value="0x7" description="Conversion start address ADC12MEM7"/>
            <bitenum id="ADC12MEM8" value="0x8" description="Conversion start address ADC12MEM8"/>
            <bitenum id="ADC12MEM9" value="0x9" description="Conversion start address ADC12MEM9"/>
            <bitenum id="ADC12MEM10" value="0xA" description="Conversion start address ADC12MEM10"/>
            <bitenum id="ADC12MEM11" value="0xB" description="Conversion start address ADC12MEM10"/>
            <bitenum id="ADC12MEM12" value="0xC" description="Conversion start address ADC12MEM12"/>
            <bitenum id="ADC12MEM13" value="0xD" description="Conversion start address ADC12MEM13"/>
            <bitenum id="ADC12MEM14" value="0xE" description="Conversion start address ADC12MEM14"/>
            <bitenum id="ADC12MEM15" value="0xF" description="Conversion start address ADC12MEM15"/>
            <bitenum id="ADC12MEM16" value="0x10" description="Conversion start address ADC12MEM16"/>
            <bitenum id="ADC12MEM17" value="0x11" description="Conversion start address ADC12MEM17"/>
            <bitenum id="ADC12MEM18" value="0x12" description="Conversion start address ADC12MEM18"/>
            <bitenum id="ADC12MEM19" value="0x13" description="Conversion start address ADC12MEM19"/>
            <bitenum id="ADC12MEM20" value="0x14" description="Conversion start address ADC12MEM20"/>
            <bitenum id="ADC12MEM21" value="0x15" description="Conversion start address ADC12MEM21"/>
            <bitenum id="ADC12MEM22" value="0x16" description="Conversion start address ADC12MEM22"/>
            <bitenum id="ADC12MEM23" value="0x17" description="Conversion start address ADC12MEM23"/>
            <bitenum id="ADC12MEM24" value="0x18" description="Conversion start address ADC12MEM24"/>
            <bitenum id="ADC12MEM25" value="0x19" description="Conversion start address ADC12MEM25"/>
            <bitenum id="ADC12MEM26" value="0x1A" description="Conversion start address ADC12MEM26"/>
            <bitenum id="ADC12MEM27" value="0x1B" description="Conversion start address ADC12MEM27"/>
            <bitenum id="ADC12MEM28" value="0x1C" description="Conversion start address ADC12MEM28"/>
            <bitenum id="ADC12MEM29" value="0x1D" description="Conversion start address ADC12MEM29"/>
            <bitenum id="ADC12MEM30" value="0x1E" description="Conversion start address ADC12MEM30"/>
            <bitenum id="ADC12MEM31" value="0x1F" description="Conversion start address ADC12MEM31"/>
        </bitfield>
        <bitfield id="ADC12BATMAP" description="1/2 AVCC ADC input channel selection" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12BATMAP_0" value="0x0" description="external pin is selected for ADC input channel A31"/>
            <bitenum id="ADC12BATMAP_1" value="0x1" description="ADC internal 1/2 x AVCC channel is selected for ADC input channel A31"/>
        </bitfield>
        <bitfield id="ADC12TCMAP" description="temperature sensor ADC input channel selection" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12TCMAP_0" value="0x0" description="external pin is selected for ADC input channel A30"/>
            <bitenum id="ADC12TCMAP_1" value="0x1" description="ADC internal temperature sensor channel is selected for ADC input channel A30"/>
        </bitfield>
        <bitfield id="ADC12ICH0MAP" description="int ch 0 sel to ADC in ch A29" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12ICH0MAP_0" value="0x0" description="external pin is selected for ADC input channel A29"/>
            <bitenum id="ADC12ICH0MAP_1" value="0x1" description="ADC input channel internal 0 is selected for ADC input channel A29, see device-specific data sheet for availability"/>
        </bitfield>
        <bitfield id="ADC12ICH1MAP" description="int ch 1 sel to ADC in ch A28" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12ICH1MAP_0" value="0x0" description="external pin is selected for ADC input channel A28"/>
            <bitenum id="ADC12ICH1MAP_1" value="0x1" description="ADC input channel internal 1 is selected for ADC input channel A28, see device-specific data sheet for availability"/>
        </bitfield>
        <bitfield id="ADC12ICH2MAP" description="int ch 2 sel to ADC in ch A27" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ADC12ICH2MAP_0" value="0x0" description="external pin is selected for ADC input channel A27"/>
            <bitenum id="ADC12ICH2MAP_1" value="0x1" description="ADC input channel internal 2 is selected for ADC input channel A27, see device-specific data sheet for availability"/>
        </bitfield>
        <bitfield id="ADC12ICH3MAP" description="int ch 3 sel to ADC in ch A26" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ADC12ICH3MAP_0" value="0x0" description="external pin is selected for ADC input channel A26"/>
            <bitenum id="ADC12ICH3MAP_1" value="0x1" description="ADC input channel internal 3 is selected for ADC input channel A26, see device-specific data sheet for availability"/>
        </bitfield>
    </register>
    <register id="ADC12LO" width="16" offset="0x8" internal="0" description="ADC12_B Window Comparator Low Threshold Register">
    </register>
    <register id="ADC12HI" width="16" offset="0xA" internal="0" description="ADC12_B Window Comparator High Threshold Register">
    </register>
    <register id="ADC12IFGR0" width="16" offset="0xC" internal="0" description="ADC12_B Interrupt Flag 0">
        <bitfield id="ADC12IFG0" description="ADC12MEM0 interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG0_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG0_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG1" description="ADC12MEM1 interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG1_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG1_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG2" description="ADC12MEM2 interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG2_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG2_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG3" description="ADC12MEM3 interrupt flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG3_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG3_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG4" description="ADC12MEM4 interrupt flag" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG4_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG4_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG5" description="ADC12MEM5 interrupt flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG5_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG5_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG6" description="ADC12MEM6 interrupt flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG6_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG6_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG7" description="ADC12MEM7 interrupt flag" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG7_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG7_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG8" description="ADC12MEM8 interrupt flag" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG8_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG8_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG9" description="ADC12MEM9 interrupt flag" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG9_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG9_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG10" description="ADC12MEM10 interrupt flag" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG10_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG10_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG11" description="ADC12MEM11 interrupt flag" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG11_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG11_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG12" description="ADC12MEM12 interrupt flag" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG12_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG12_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG13" description="ADC12MEM13 interrupt flag" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG13_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG13_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG14" description="ADC12MEM14 interrupt flag" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG14_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG14_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG15" description="ADC12MEM15 interrupt flag" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG15_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG15_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
