pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
    <register id="ADC12IFGR1" width="16" offset="0xE" internal="0" description="ADC12_B Interrupt Flag 1">
        <bitfield id="ADC12IFG16" description="ADC12MEM16 interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG16_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG16_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG17" description="ADC12MEM17 interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG17_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG17_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG18" description="ADC12MEM18 interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG18_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG18_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG19" description="ADC12MEM19 interrupt flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG19_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG19_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG20" description="ADC12MEM20 interrupt flag" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG20_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG20_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG21" description="ADC12MEM21 interrupt flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG21_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG21_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG22" description="ADC12MEM22 interrupt flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG22_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG22_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG23" description="ADC12MEM23 interrupt flag" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG23_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG23_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG24" description="ADC12MEM24 interrupt flag" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG24_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG24_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG25" description="ADC12MEM25 interrupt flag" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG25_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG25_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG26" description="ADC12MEM26 interrupt flag" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG26_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG26_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG27" description="ADC12MEM27 interrupt flag" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG27_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG27_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG28" description="ADC12MEM28 interrupt flag" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG28_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG28_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG29" description="ADC12MEM29 interrupt flag" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG29_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG29_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG30" description="ADC12MEM30 interrupt flag" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG30_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG30_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12IFG31" description="ADC12MEM31 interrupt flag" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="ADC12IFG31_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12IFG31_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="ADC12IFGR2" width="16" offset="0x10" internal="0" description="ADC12_B Interrupt Flag 2">
        <bitfield id="ADC12INIFG" description="Interrupt flag for ADC12MEMx between ADC12HI and ADC12LO" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12INIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12INIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12LOIFG" description="Interrupt flag for ADC12MEMx ADC12LO" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12LOIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12LOIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12HIIFG" description="Interrupt flag for ADC12MEMx ADC12HI" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12HIIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12HIIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12OVIFG" description="ADC12MEMx overflow-interrupt flag." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12OVIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12OVIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12TOVIFG" description="conversion-time-overflow interrupt flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12TOVIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12TOVIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC12RDYIFG" description="reference buffer ready interrupt flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12RDYIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC12RDYIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
