pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
    <register id="ADC12IER0" width="16" offset="0x12" internal="0" description="ADC12_B Interrupt Enable 0">
        <bitfield id="ADC12IE0" description="Interrupt enable 0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE0_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE0_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE1" description="interrupt enable 1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE1_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE1_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE2" description="interrupt enable 2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE2_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE2_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE3" description="interrupt enable 3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE3_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE3_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE4" description="interrupt enable 4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE4_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE4_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE5" description="interrupt enable 5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE5_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE5_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE6" description="interrupt enable 6" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE6_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE6_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE7" description="interrupt enable 7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE7_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE7_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE8" description="interrupt enable 8" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE8_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE8_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE9" description="interrupt enable 9" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE9_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE9_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE10" description="interrupt enable 10" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE10_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE10_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE11" description="interrupt enable  11" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE11_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE11_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE12" description="interrupt enable 12" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE12_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE12_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE13" description="interrupt enable  13" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE13_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE13_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE14" description="interrupt enable 14" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE14_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE14_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE15" description="interrupt enable 15" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE15_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE15_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="ADC12IER1" width="16" offset="0x14" internal="0" description="ADC12_B Interrupt Enable 1">
        <bitfield id="ADC12IE16" description="interrupt enable 16" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE16_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE16_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE17" description="interrupt enable 17" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE17_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE17_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE18" description="interrupt enable 18" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE18_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE18_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE19" description="interrupt enable  19" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE19_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE19_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE20" description="interrupt enable 19" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE20_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE20_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE21" description="interrupt enable 21" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE21_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE21_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE22" description="interrupt enable 22" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE22_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE22_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE23" description="interrupt enable 23" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE23_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE23_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE24" description="interrupt enable 24" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE24_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE24_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE25" description="interrupt enable 25" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE25_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE25_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE26" description="interrupt enable 26" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE26_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE26_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE27" description="interrupt enable 27" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE27_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE27_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE28" description="interrupt enable  28" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE28_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE28_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE29" description="interrupt enable 29" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE29_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE29_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE30" description="interrupt enable 30" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE30_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE30_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12IE31" description="interrupt enable 30" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="ADC12IE31_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12IE31_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="ADC12IER2" width="16" offset="0x16" internal="0" description="ADC12_B Interrupt Enable 2">
        <bitfield id="ADC12INIE" description="interrupt enable MEMx between ADC12HI and LO" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ADC12INIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12INIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12LOIE" description="interrupt enable MEMx  ADC12LO" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC12LOIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12LOIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12HIIE" description="interrupt enable MEMx  ADC12HI" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="ADC12HIIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12HIIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12OVIE" description="ADC12MEMx overflow-interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ADC12OVIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12OVIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12TOVIE" description="conversion-time-overflow interrupt enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="ADC12TOVIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12TOVIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="ADC12RDYIE" description="interrupt enable ADC ref buffer ready" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="ADC12RDYIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ADC12RDYIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="ADC12IV" width="16" offset="0x18" internal="0" description="ADC12_B Interrupt Vector">
        <bitfield id="ADC12IV" description="interrupt vector value" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="Interrupt Source: No interrupt pending, Interrupt Flag: None"/>
            <bitenum id="ADC12OVIFG" value="0x2" description="Interrupt Source: ADC12MEMx overflow, Interrupt Flag: ADC12OVIFG, Interrupt Priority: Highest"/>
            <bitenum id="ADC12TOVIFG" value="0x4" description="Interrupt Source: Conversion time overflow, Interrupt Flag: ADC12TOVIFG"/>
            <bitenum id="ADC12HIIFG" value="0x6" description="Interrupt Source: ADC12 window high interrupt flag, Interrupt Flag: ADC12HIIFG"/>
            <bitenum id="ADC12LOIFG" value="0x8" description="Interrupt Source: ADC12 window low interrupt flag, Interrupt Flag: ADC12LOIFG"/>
            <bitenum id="ADC12INIFG" value="0xA" description="Interrupt Source: ADC12 in-window interrupt flag, Interrupt Flag: ADC12INIFG"/>
            <bitenum id="ADC12IFG0" value="0xC" description="Interrupt Source: ADC12MEM0 interrupt flag, Interrupt Flag: ADC12IFG0"/>
            <bitenum id="ADC12IFG1" value="0xE" description="Interrupt Source: ADC12MEM1 interrupt flag, Interrupt Flag: ADC12IFG1"/>
            <bitenum id="ADC12IFG2" value="0x10" description="Interrupt Source: ADC12MEM2 interrupt flag, Interrupt Flag: ADC12IFG2"/>
            <bitenum id="ADC12IFG3" value="0x12" description="Interrupt Source: ADC12MEM3 interrupt flag, Interrupt Flag: ADC12IFG3"/>
            <bitenum id="ADC12IFG4" value="0x14" description="Interrupt Source: ADC12MEM4 interrupt flag, Interrupt Flag: ADC12IFG4"/>
            <bitenum id="ADC12IFG5" value="0x16" description="Interrupt Source: ADC12MEM5 interrupt flag, Interrupt Flag: ADC12IFG5"/>
            <bitenum id="ADC12IFG6" value="0x18" description="Interrupt Source: ADC12MEM6 interrupt flag, Interrupt Flag: ADC12IFG6"/>
            <bitenum id="ADC12IFG7" value="0x1A" description="Interrupt Source: ADC12MEM7 interrupt flag, Interrupt Flag: ADC12IFG7"/>
            <bitenum id="ADC12IFG8" value="0x1C" description="Interrupt Source: ADC12MEM8 interrupt flag, Interrupt Flag: ADC12IFG8"/>
            <bitenum id="ADC12IFG9" value="0x1E" description="Interrupt Source: ADC12MEM9 interrupt flag, Interrupt Flag: ADC12IFG9"/>
            <bitenum id="ADC12IFG10" value="0x20" description="Interrupt Source: ADC12MEM10 interrupt flag, Interrupt Flag: ADC12IFG10"/>
            <bitenum id="ADC12IFG11" value="0x22" description="Interrupt Source: ADC12MEM11 interrupt flag, Interrupt Flag: ADC12IFG11"/>
            <bitenum id="ADC12IFG12" value="0x24" description="Interrupt Source: ADC12MEM12 interrupt flag, Interrupt Flag: ADC12IFG12"/>
            <bitenum id="ADC12IFG13" value="0x26" description="Interrupt Source: ADC12MEM13 interrupt flag, Interrupt Flag: ADC12IFG13"/>
            <bitenum id="ADC12IFG14" value="0x28" description="Interrupt Source: ADC12MEM14 interrupt flag, Interrupt Flag: ADC12IFG14"/>
            <bitenum id="ADC12IFG15" value="0x2A" description="Interrupt Source: ADC12MEM15 interrupt flag, Interrupt Flag: ADC12IFG15"/>
            <bitenum id="ADC12IFG16" value="0x2C" description="Interrupt Source: ADC12MEM16 interrupt flag, Interrupt Flag: ADC12IFG16"/>
            <bitenum id="ADC12IFG17" value="0x2E" description="Interrupt Source: ADC12MEM17 interrupt flag, Interrupt Flag: ADC12IFG17"/>
            <bitenum id="ADC12IFG18" value="0x30" description="Interrupt Source: ADC12MEM18 interrupt flag, Interrupt Flag: ADC12IFG18"/>
            <bitenum id="ADC12IFG19" value="0x32" description="Interrupt Source: ADC12MEM19 interrupt flag, Interrupt Flag: ADC12IFG19"/>
            <bitenum id="ADC12IFG20" value="0x34" description="Interrupt Source: ADC12MEM20 interrupt flag, Interrupt Flag: ADC12IFG20"/>
            <bitenum id="ADC12IFG21" value="0x36" description="Interrupt Source: ADC12MEM21 interrupt flag, Interrupt Flag: ADC12IFG21"/>
            <bitenum id="ADC12IFG22" value="0x38" description="Interrupt Source: ADC12MEM22 interrupt flag, Interrupt Flag: ADC12IFG22"/>
            <bitenum id="ADC12IFG23" value="0x3A" description="Interrupt Source: ADC12MEM23 interrupt flag, Interrupt Flag: ADC12IFG23"/>
            <bitenum id="ADC12IFG24" value="0x3C" description="Interrupt Source: ADC12MEM24 interrupt flag, Interrupt Flag: ADC12IFG24"/>
            <bitenum id="ADC12IFG25" value="0x3E" description="Interrupt Source: ADC12MEM25 interrupt flag, Interrupt Flag: ADC12IFG25"/>
            <bitenum id="ADC12IFG26" value="0x40" description="Interrupt Source: ADC12MEM26 interrupt flag, Interrupt Flag: ADC12IFG26"/>
            <bitenum id="ADC12IFG27" value="0x42" description="Interrupt Source: ADC12MEM27 interrupt flag, Interrupt Flag: ADC12IFG27"/>
            <bitenum id="ADC12IFG28" value="0x44" description="Interrupt Source: ADC12MEM28 interrupt flag, Interrupt Flag: ADC12IFG28"/>
            <bitenum id="ADC12IFG29" value="0x46" description="Interrupt Source: ADC12MEM29 interrupt flag, Interrupt Flag: ADC12IFG29"/>
            <bitenum id="ADC12IFG30" value="0x48" description="Interrupt Source: ADC12MEM30 interrupt flag, Interrupt Flag: ADC12IFG30"/>
            <bitenum id="ADC12IFG31" value="0x4A" description="Interrupt Source: ADC12MEM31 interrupt flag, Interrupt Flag: ADC12IFG31"/>
            <bitenum id="ADC12RDYIFG" value="0x4C" description="Interrupt Source: ADC12RDYIFG interrupt flag, Interrupt Flag: ADC12RDYIFG"/>
        </bitfield>
    </register>
