pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
    <register id="ADC12MCTL0" width="16" offset="0x20" internal="0" description="ADC12_B Memory Control 0 Register to ADC12_B Memory Control 31 Register">
        <bitfield id="ADC12INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC12INCH_0" value="0x0" description="If ADC12DIF = 0: A0; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_1" value="0x1" description="If ADC12DIF = 0: A1; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_2" value="0x2" description="If ADC12DIF = 0: A2; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_3" value="0x3" description="If ADC12DIF = 0: A3; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_4" value="0x4" description="If ADC12DIF = 0: A4; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_5" value="0x5" description="If ADC12DIF = 0: A5; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_6" value="0x6" description="If ADC12DIF = 0: A6; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_7" value="0x7" description="If ADC12DIF = 0: A7; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_8" value="0x8" description="If ADC12DIF = 0: A8; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_9" value="0x9" description="If ADC12DIF = 0: A9; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_10" value="0xA" description="If ADC12DIF = 0: A10; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_11" value="0xB" description="If ADC12DIF = 0: A11; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_12" value="0xC" description="If ADC12DIF = 0: A12; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_13" value="0xD" description="If ADC12DIF = 0: A13; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_14" value="0xE" description="If ADC12DIF = 0: A14; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_15" value="0xF" description="If ADC12DIF = 0: A15; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_16" value="0x10" description="If ADC12DIF = 0: A16; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_17" value="0x11" description="If ADC12DIF = 0: A17; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_18" value="0x12" description="If ADC12DIF = 0: A18; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_19" value="0x13" description="If ADC12DIF = 0: A19; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_20" value="0x14" description="If ADC12DIF = 0: A20; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_21" value="0x15" description="If ADC12DIF = 0: A21; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_22" value="0x16" description="If ADC12DIF = 0: A22; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_23" value="0x17" description="If ADC12DIF = 0: A23; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_24" value="0x18" description="If ADC12DIF = 0: A24; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_25" value="0x19" description="If ADC12DIF = 0: A25; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_26" value="0x1A" description="If ADC12DIF = 0: A26; If ADC12DIF = 1: Ain+ = A26, Ain- =A27"/>
            <bitenum id="ADC12INCH_27" value="0x1B" description="If ADC12DIF = 0: A27; If ADC12DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC12INCH_28" value="0x1C" description="If ADC12DIF = 0: A28; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_29" value="0x1D" description="If ADC12DIF = 0: A29; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_30" value="0x1E" description="If ADC12DIF = 0: A30; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC12INCH_31" value="0x1F" description="If ADC12DIF = 0: A31; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC12EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC12EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC12VRSEL" description="reference selection" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC12VRSEL_0" value="0x0" description="VR+ = AVCC, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_1" value="0x1" description="VR+ = VREF buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_2" value="0x2" description="VR+ = VeREF-, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_3" value="0x3" description="VR+ = VeREF+ buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_4" value="0x4" description="VR+ = VeREF+, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_5" value="0x5" description="VR+ = AVCC, VR- = VeREF+ buffered"/>
            <bitenum id="ADC12VRSEL_6" value="0x6" description="VR+ = AVCC, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_7" value="0x7" description="VR+ = VREF buffered, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_8" value="0x8" description="Reserved"/>
            <bitenum id="ADC12VRSEL_9" value="0x9" description="VR+ = AVCC, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_10" value="0xA" description="Reserved"/>
            <bitenum id="ADC12VRSEL_11" value="0xB" description="VR+ = VeREF+, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_12" value="0xC" description="VR+ = AVCC, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_13" value="0xD" description="VR+ = VREF buffered, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_14" value="0xE" description="VR+ = VeREF+, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_15" value="0xF" description="VR+ = VeREF+ buffered, VR- = VeREF-"/>
        </bitfield>
        <bitfield id="ADC12DIF" description="Differential mode." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC12DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC12WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12WINC_0" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ADC12WINC_1" value="0x1" description="Comparator window enabled"/>
        </bitfield>
    </register>
    <register id="ADC12MCTL1" width="16" offset="0x22" internal="0" description="ADC12_B Memory Control 0 Register to ADC12_B Memory Control 31 Register">
        <bitfield id="ADC12INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC12INCH_0" value="0x0" description="If ADC12DIF = 0: A0; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_1" value="0x1" description="If ADC12DIF = 0: A1; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_2" value="0x2" description="If ADC12DIF = 0: A2; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_3" value="0x3" description="If ADC12DIF = 0: A3; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_4" value="0x4" description="If ADC12DIF = 0: A4; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_5" value="0x5" description="If ADC12DIF = 0: A5; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_6" value="0x6" description="If ADC12DIF = 0: A6; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_7" value="0x7" description="If ADC12DIF = 0: A7; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_8" value="0x8" description="If ADC12DIF = 0: A8; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_9" value="0x9" description="If ADC12DIF = 0: A9; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_10" value="0xA" description="If ADC12DIF = 0: A10; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_11" value="0xB" description="If ADC12DIF = 0: A11; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_12" value="0xC" description="If ADC12DIF = 0: A12; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_13" value="0xD" description="If ADC12DIF = 0: A13; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_14" value="0xE" description="If ADC12DIF = 0: A14; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_15" value="0xF" description="If ADC12DIF = 0: A15; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_16" value="0x10" description="If ADC12DIF = 0: A16; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_17" value="0x11" description="If ADC12DIF = 0: A17; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_18" value="0x12" description="If ADC12DIF = 0: A18; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_19" value="0x13" description="If ADC12DIF = 0: A19; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_20" value="0x14" description="If ADC12DIF = 0: A20; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_21" value="0x15" description="If ADC12DIF = 0: A21; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_22" value="0x16" description="If ADC12DIF = 0: A22; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_23" value="0x17" description="If ADC12DIF = 0: A23; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_24" value="0x18" description="If ADC12DIF = 0: A24; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_25" value="0x19" description="If ADC12DIF = 0: A25; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_26" value="0x1A" description="If ADC12DIF = 0: A26; If ADC12DIF = 1: Ain+ = A26, Ain- =A27"/>
            <bitenum id="ADC12INCH_27" value="0x1B" description="If ADC12DIF = 0: A27; If ADC12DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC12INCH_28" value="0x1C" description="If ADC12DIF = 0: A28; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_29" value="0x1D" description="If ADC12DIF = 0: A29; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_30" value="0x1E" description="If ADC12DIF = 0: A30; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC12INCH_31" value="0x1F" description="If ADC12DIF = 0: A31; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC12EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC12EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC12VRSEL" description="reference selection" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC12VRSEL_0" value="0x0" description="VR+ = AVCC, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_1" value="0x1" description="VR+ = VREF buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_2" value="0x2" description="VR+ = VeREF-, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_3" value="0x3" description="VR+ = VeREF+ buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_4" value="0x4" description="VR+ = VeREF+, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_5" value="0x5" description="VR+ = AVCC, VR- = VeREF+ buffered"/>
            <bitenum id="ADC12VRSEL_6" value="0x6" description="VR+ = AVCC, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_7" value="0x7" description="VR+ = VREF buffered, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_8" value="0x8" description="Reserved"/>
            <bitenum id="ADC12VRSEL_9" value="0x9" description="VR+ = AVCC, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_10" value="0xA" description="Reserved"/>
            <bitenum id="ADC12VRSEL_11" value="0xB" description="VR+ = VeREF+, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_12" value="0xC" description="VR+ = AVCC, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_13" value="0xD" description="VR+ = VREF buffered, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_14" value="0xE" description="VR+ = VeREF+, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_15" value="0xF" description="VR+ = VeREF+ buffered, VR- = VeREF-"/>
        </bitfield>
        <bitfield id="ADC12DIF" description="Differential mode." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC12DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC12WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12WINC_0" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ADC12WINC_1" value="0x1" description="Comparator window enabled"/>
        </bitfield>
    </register>
    <register id="ADC12MCTL2" width="16" offset="0x24" internal="0" description="ADC12_B Memory Control 0 Register to ADC12_B Memory Control 31 Register">
        <bitfield id="ADC12INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC12INCH_0" value="0x0" description="If ADC12DIF = 0: A0; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_1" value="0x1" description="If ADC12DIF = 0: A1; If ADC12DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC12INCH_2" value="0x2" description="If ADC12DIF = 0: A2; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_3" value="0x3" description="If ADC12DIF = 0: A3; If ADC12DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC12INCH_4" value="0x4" description="If ADC12DIF = 0: A4; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_5" value="0x5" description="If ADC12DIF = 0: A5; If ADC12DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC12INCH_6" value="0x6" description="If ADC12DIF = 0: A6; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_7" value="0x7" description="If ADC12DIF = 0: A7; If ADC12DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC12INCH_8" value="0x8" description="If ADC12DIF = 0: A8; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_9" value="0x9" description="If ADC12DIF = 0: A9; If ADC12DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC12INCH_10" value="0xA" description="If ADC12DIF = 0: A10; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_11" value="0xB" description="If ADC12DIF = 0: A11; If ADC12DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC12INCH_12" value="0xC" description="If ADC12DIF = 0: A12; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_13" value="0xD" description="If ADC12DIF = 0: A13; If ADC12DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC12INCH_14" value="0xE" description="If ADC12DIF = 0: A14; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_15" value="0xF" description="If ADC12DIF = 0: A15; If ADC12DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC12INCH_16" value="0x10" description="If ADC12DIF = 0: A16; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_17" value="0x11" description="If ADC12DIF = 0: A17; If ADC12DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC12INCH_18" value="0x12" description="If ADC12DIF = 0: A18; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_19" value="0x13" description="If ADC12DIF = 0: A19; If ADC12DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC12INCH_20" value="0x14" description="If ADC12DIF = 0: A20; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_21" value="0x15" description="If ADC12DIF = 0: A21; If ADC12DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC12INCH_22" value="0x16" description="If ADC12DIF = 0: A22; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_23" value="0x17" description="If ADC12DIF = 0: A23; If ADC12DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC12INCH_24" value="0x18" description="If ADC12DIF = 0: A24; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_25" value="0x19" description="If ADC12DIF = 0: A25; If ADC12DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC12INCH_26" value="0x1A" description="If ADC12DIF = 0: A26; If ADC12DIF = 1: Ain+ = A26, Ain- =A27"/>
            <bitenum id="ADC12INCH_27" value="0x1B" description="If ADC12DIF = 0: A27; If ADC12DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC12INCH_28" value="0x1C" description="If ADC12DIF = 0: A28; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_29" value="0x1D" description="If ADC12DIF = 0: A29; If ADC12DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC12INCH_30" value="0x1E" description="If ADC12DIF = 0: A30; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC12INCH_31" value="0x1F" description="If ADC12DIF = 0: A31; If ADC12DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC12EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC12EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC12EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC12VRSEL" description="reference selection" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC12VRSEL_0" value="0x0" description="VR+ = AVCC, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_1" value="0x1" description="VR+ = VREF buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_2" value="0x2" description="VR+ = VeREF-, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_3" value="0x3" description="VR+ = VeREF+ buffered, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_4" value="0x4" description="VR+ = VeREF+, VR- = AVSS"/>
            <bitenum id="ADC12VRSEL_5" value="0x5" description="VR+ = AVCC, VR- = VeREF+ buffered"/>
            <bitenum id="ADC12VRSEL_6" value="0x6" description="VR+ = AVCC, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_7" value="0x7" description="VR+ = VREF buffered, VR- = VeREF+"/>
            <bitenum id="ADC12VRSEL_8" value="0x8" description="Reserved"/>
            <bitenum id="ADC12VRSEL_9" value="0x9" description="VR+ = AVCC, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_10" value="0xA" description="Reserved"/>
            <bitenum id="ADC12VRSEL_11" value="0xB" description="VR+ = VeREF+, VR- = VREF buffered"/>
            <bitenum id="ADC12VRSEL_12" value="0xC" description="VR+ = AVCC, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_13" value="0xD" description="VR+ = VREF buffered, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_14" value="0xE" description="VR+ = VeREF+, VR- = VeREF-"/>
            <bitenum id="ADC12VRSEL_15" value="0xF" description="VR+ = VeREF+ buffered, VR- = VeREF-"/>
        </bitfield>
        <bitfield id="ADC12DIF" description="Differential mode." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC12DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC12DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC12WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ADC12WINC_0" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ADC12WINC_1" value="0x1" description="Comparator window enabled"/>
        </bitfield>
    </register>
