pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/ADC12_B_367.0.xml
    <register id="ADC12MEM3" width="16" offset="0x66" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM4" width="16" offset="0x68" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM5" width="16" offset="0x6A" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM6" width="16" offset="0x6C" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM7" width="16" offset="0x6E" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM8" width="16" offset="0x70" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM9" width="16" offset="0x72" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM10" width="16" offset="0x74" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM11" width="16" offset="0x76" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM12" width="16" offset="0x78" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM13" width="16" offset="0x7A" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM14" width="16" offset="0x7C" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM15" width="16" offset="0x7E" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM16" width="16" offset="0x80" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM17" width="16" offset="0x82" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM18" width="16" offset="0x84" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM19" width="16" offset="0x86" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM20" width="16" offset="0x88" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM21" width="16" offset="0x8A" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM22" width="16" offset="0x8C" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM23" width="16" offset="0x8E" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM24" width="16" offset="0x90" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM25" width="16" offset="0x92" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM26" width="16" offset="0x94" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM27" width="16" offset="0x96" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM28" width="16" offset="0x98" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM29" width="16" offset="0x9A" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM30" width="16" offset="0x9C" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
    <register id="ADC12MEM31" width="16" offset="0x9E" internal="0" description="ADC12_B Memory 0 Register to ADC12_B Memory 31 Register">
    </register>
</module>
